Project/Toir/src/DataProcessors/торо_ЗагрузкаНоменклатурыИзExcel/торо_ЗагрузкаНоменклатурыИзExcel.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>торо_ЗагрузкаНоменклатурыИзExcel</name>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяСтрокаЗаголовок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Project/Toir/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеХарактеристик</name>
    <type>
      <types>EnumRef.ВариантыИспользованияХарактеристикНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/DataProcessors/торо_ЗагрузкаНоменклатурыИзExcel/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// По умолчанию: первая строка файла — заголовок колонок.
	Объект.ПерваяСтрокаЗаголовок = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНоменклатураКЗагрузке

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьФайл(Команда)

	АдресВременногоХранилища = Неопределено;

	// Почему НачатьПомещениеФайла с ОписаниеОповещения, а не модальное ПоместитьФайл:
	// проект на совместимости 8.3.12, управляемые формы — модальность запрещена (№703).
	// Паттерн подтверждён реальным вызовом в ЗагрузкаОКОФ/Forms/Форма/Module.bsl.
	Попытка
		НачатьПомещениеФайла(
			Новый ОписаниеОповещения("ВыбратьФайлЗавершение", ЭтотОбъект),
			АдресВременногоХранилища,
			,
			Истина,
			УникальныйИдентификатор);
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ПоказатьПредупреждение(, ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

// Обработчик завершения выбора файла через НачатьПомещениеФайла.
// Экспортный — вызывается платформой через ОписаниеОповещения.
//
// Параметры:
//   Результат - Булево - Истина, если пользователь выбрал файл.
//   Адрес - Строка - адрес помещённого во временное хранилище файла.
//   ИмяВыбранногоФайла - Строка - отображаемое имя выбранного файла.
//   ДополнительныеПараметры - Структура - параметры, переданные в ОписаниеОповещения.
&НаКлиенте
Процедура ВыбратьФайлЗавершение(Результат, Адрес, ИмяВыбранногоФайла, ДополнительныеПараметры) Экспорт

	Если НЕ Результат Тогда
		Возврат;
	КонецЕсли;

	АдресВременногоХранилища = Адрес;
	Объект.ИмяФайла = ИмяВыбранногоФайла;

	ПрочитатьФайлНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)

	Если НоменклатураКЗагрузке.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Нет данных для загрузки. Сначала выберите файл.'"));
		Возврат;
	КонецЕсли;

	Результат = ЗаписатьНоменклатуруНаСервере();

	ТекстИтога = СтрШаблон(
		НСтр("ru = 'Загрузка завершена. Создано: %1, обновлено: %2, ошибок: %3.'"),
		Результат.Создано, Результат.Обновлено, Результат.Ошибок);
	ПоказатьПредупреждение(, ТекстИтога);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьФайлНаСервере()

	НоменклатураКЗагрузке.Очистить();

	Если ПустаяСтрока(АдресВременногоХранилища) Тогда
		Возврат;
	КонецЕсли;

	// Почему ТабличныйДокумент.Прочитать, а не COM("Excel.Application"):
	// COM требует установленного Excel и работает только на Windows;
	// табдок кросс-платформенный (8.3.10+), поддерживает .xlsx/.mxl.
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	ДанныеФайла.Записать(ИмяВременногоФайла);

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Прочитать(ИмяВременногоФайла);

	УдалитьФайлы(ИмяВременногоФайла);

	ЗаполнитьТаблицуИзТабДока(ТабДок);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуИзТабДока(ТабДок)

	// Ожидаемые колонки файла: Код, Наименование, Артикул, ВидНоменклатуры, Производитель.
	НомерПервойСтроки = ?(Объект.ПерваяСтрокаЗаголовок, 2, 1);

	Для НомерСтроки = НомерПервойСтроки По ТабДок.ВысотаТаблицы Цикл

		Код          = СокрЛП(ТабДок.Область(НомерСтроки, 1).Текст);
		Наименование = СокрЛП(ТабДок.Область(НомерСтроки, 2).Текст);

		// Пропуск пустых строк.
		Если ПустаяСтрока(Код) И ПустаяСтрока(Наименование) Тогда
			Продолжить;
		КонецЕсли;

		СтрокаТЗ = НоменклатураКЗагрузке.Добавить();
		СтрокаТЗ.Код             = Код;
		СтрокаТЗ.Наименование    = Наименование;
		СтрокаТЗ.Артикул         = СокрЛП(ТабДок.Область(НомерСтроки, 3).Текст);
		СтрокаТЗ.ВидНоменклатуры = СокрЛП(ТабДок.Область(НомерСтроки, 4).Текст);
		СтрокаТЗ.Производитель   = СокрЛП(ТабДок.Область(НомерСтроки, 5).Текст);
		СтрокаТЗ.УжеСуществует   = Ложь;

	КонецЦикла;

	// Пакетная проверка существующих — одним запросом (№436: не в цикле).
	ОтметитьСуществующие();

КонецПроцедуры

&НаСервере
Процедура ОтметитьСуществующие()

	Если НоменклатураКЗагрузке.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	МассивКодов = ПолучитьМассивНепустыхКодов();

	Если МассивКодов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	СоответствиеКодов = ПолучитьСоответствиеНоменклатурыПоКодам(МассивКодов);

	Для Каждого СтрокаТЗ Из НоменклатураКЗагрузке Цикл
		Если НЕ ПустаяСтрока(СтрокаТЗ.Код)
			И ЗначениеЗаполнено(СоответствиеКодов.Получить(СтрокаТЗ.Код)) Тогда
			СтрокаТЗ.УжеСуществует = Истина;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ЗаписатьНоменклатуруНаСервере()

	// Почему кэши ищем ОДНИМ запросом до цикла, а не НайтиПоНаименованию в цикле:
	// №436 — запрос к БД в цикле; для 1000 строк это тысячи запросов вместо трёх.
	МассивКодов = ПолучитьМассивНепустыхКодов();
	СоответствиеСуществующих = ПолучитьСоответствиеНоменклатурыПоКодам(МассивКодов);
	СоответствиеВидов = ПолучитьКэшСправочника("ВидыНоменклатуры");
	СоответствиеПроизводителей = ПолучитьКэшСправочника("Производители");

	Результат = Новый Структура("Создано, Обновлено, Ошибок", 0, 0, 0);

	Для Каждого СтрокаТЗ Из НоменклатураКЗагрузке Цикл

		// Определяем «новый или существующий» до валидации: для нового элемента
		// обязательный реквизит ВидНоменклатуры нельзя оставить пустым.
		Ссылка = СоответствиеСуществующих.Получить(СтрокаТЗ.Код);
		ЭтоНовый = НЕ ЗначениеЗаполнено(Ссылка);

		// Валидация до записи: выдаём понятное сообщение вместо системной ошибки.
		ТекстОшибкиПроверки = ПроверитьСтроку(СтрокаТЗ, ЭтоНовый, СоответствиеВидов, СоответствиеПроизводителей);
		Если НЕ ПустаяСтрока(ТекстОшибкиПроверки) Тогда
			СтрокаТЗ.Статус = ТекстОшибкиПроверки;
			Результат.Ошибок = Результат.Ошибок + 1;
			Продолжить;
		КонецЕсли;

		Попытка

			// Почему без явной транзакции: Записать() открывает неявную транзакцию на одну
			// строку — этого достаточно для атомарности одной записи. Внешняя транзакция
			// здесь лишь создавала бы savepoint без пользы (locks-transactions.md §2).
			Если ЭтоНовый Тогда
				ОбъектНоменклатуры = Справочники.Номенклатура.СоздатьЭлемент();
				ОбъектНоменклатуры.Код = СтрокаТЗ.Код;
			Иначе
				ОбъектНоменклатуры = Ссылка.ПолучитьОбъект();
			КонецЕсли;

			ОбъектНоменклатуры.Наименование = СтрокаТЗ.Наименование;
			ОбъектНоменклатуры.Артикул       = СтрокаТЗ.Артикул;

			Если НЕ ПустаяСтрока(СтрокаТЗ.ВидНоменклатуры) Тогда
				ОбъектНоменклатуры.ВидНоменклатуры = СоответствиеВидов.Получить(СтрокаТЗ.ВидНоменклатуры);
			КонецЕсли;

			Если НЕ ПустаяСтрока(СтрокаТЗ.Производитель) Тогда
				ОбъектНоменклатуры.Производитель = СоответствиеПроизводителей.Получить(СтрокаТЗ.Производитель);
			КонецЕсли;

			ОбъектНоменклатуры.Записать();

			Если ЭтоНовый Тогда
				Результат.Создано = Результат.Создано + 1;
				СтрокаТЗ.Статус = НСтр("ru = 'Создан'");
				СтрокаТЗ.УжеСуществует = Истина;
			Иначе
				Результат.Обновлено = Результат.Обновлено + 1;
				СтрокаТЗ.Статус = НСтр("ru = 'Обновлён'");
			КонецЕсли;

		Исключение
			// №499 — логируем причину, не глотаем молча.
			ЗаписьЖурналаРегистрации(
				"торо_ЗагрузкаНоменклатуры.Ошибка",
				УровеньЖурналаРегистрации.Ошибка,
				,
				,
				"Код: " + СтрокаТЗ.Код + ". " + ОписаниеОшибки());

			СтрокаТЗ.Статус = НСтр("ru = 'Ошибка: '") + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			Результат.Ошибок = Результат.Ошибок + 1;
		КонецПопытки;

	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает текст ошибки валидации строки или пустую строку, если строка корректна.
// Проверки дублируют ограничения метаданных справочника, но дают понятное сообщение
// вместо системного "Не заполнено поле..." при массовой записи.
//
// Параметры:
//   СтрокаТЗ - СтрокаТаблицыЗначений - строка с загружаемыми данными.
//   ЭтоНовый - Булево - Истина для создаваемого элемента (ВидНоменклатуры обязателен).
//   СоответствиеВидов - Соответствие - кэш ВидыНоменклатуры по наименованию.
//   СоответствиеПроизводителей - Соответствие - кэш Производители по наименованию.
&НаСервере
Функция ПроверитьСтроку(СтрокаТЗ, ЭтоНовый, СоответствиеВидов, СоответствиеПроизводителей)

	Если ПустаяСтрока(СтрокаТЗ.Код) Тогда
		Возврат НСтр("ru = 'Ошибка: не указан код'");
	КонецЕсли;

	// Длина кода справочника Номенклатура = 11 (mdo: codeLength).
	Если СтрДлина(СтрокаТЗ.Код) > 11 Тогда
		Возврат СтрШаблон(НСтр("ru = 'Ошибка: код длиннее 11 символов (%1)'"), СтрокаТЗ.Код);
	КонецЕсли;

	Если ПустаяСтрока(СтрокаТЗ.Наименование) Тогда
		Возврат НСтр("ru = 'Ошибка: не указано наименование'");
	КонецЕсли;

	// ВидНоменклатуры обязателен (fillChecking=ShowError). Для нового элемента
	// отсутствие вида недопустимо; для существующего вид уже заполнен в базе.
	Если ЭтоНовый И ПустаяСтрока(СтрокаТЗ.ВидНоменклатуры) Тогда
		Возврат НСтр("ru = 'Ошибка: не указан обязательный вид номенклатуры'");
	КонецЕсли;

	// Если вид указан, но не найден в кэше — запись упадёт; проверяем заранее.
	Если НЕ ПустаяСтрока(СтрокаТЗ.ВидНоменклатуры)
		И НЕ ЗначениеЗаполнено(СоответствиеВидов.Получить(СтрокаТЗ.ВидНоменклатуры)) Тогда
		Возврат СтрШаблон(НСтр("ru = 'Ошибка: вид номенклатуры не найден: %1'"), СтрокаТЗ.ВидНоменклатуры);
	КонецЕсли;

	Если НЕ ПустаяСтрока(СтрокаТЗ.Производитель)
		И НЕ ЗначениеЗаполнено(СоответствиеПроизводителей.Получить(СтрокаТЗ.Производитель)) Тогда
		Возврат СтрШаблон(НСтр("ru = 'Ошибка: производитель не найден: %1'"), СтрокаТЗ.Производитель);
	КонецЕсли;

	Возврат "";

КонецФункции

&НаСервере
Функция ПолучитьМассивНепустыхКодов()

	МассивКодов = Новый Массив;
	Для Каждого СтрокаТЗ Из НоменклатураКЗагрузке Цикл
		Если НЕ ПустаяСтрока(СтрокаТЗ.Код) Тогда
			МассивКодов.Добавить(СтрокаТЗ.Код);
		КонецЕсли;
	КонецЦикла;

	Возврат МассивКодов;

КонецФункции

// Пакетный поиск существующих элементов Номенклатуры по кодам.
// Используется и для предпросмотра (ОтметитьСуществующие), и при записи —
// чтобы не вызывать НайтиПоКоду в цикле (№436).
&НаСервере
Функция ПолучитьСоответствиеНоменклатурыПоКодам(МассивКодов)

	Результат = Новый Соответствие;

	Если МассивКодов.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Код КАК Код
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Код В (&МассивКодов)";

	Запрос.УстановитьПараметр("МассивКодов", МассивКодов);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Код, Выборка.Ссылка);
	КонецЦикла;

	Возврат Результат;

КонецФункции

&НаСервере
Функция ПолучитьКэшСправочника(ИмяСправочника)

	// Почему пакетный запрос, а не НайтиПоНаименованию в цикле:
	// №436 — строим кэш один раз, в цикле обращаемся к соответствию в памяти.
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Наименование КАК Наименование,
		|	Ссылка КАК Ссылка
		|ИЗ
		|	Справочник." + ИмяСправочника + "
		|ГДЕ
		|	НЕ Наименование = """" ";

	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Наименование, Выборка.Ссылка);
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти
